; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image1 - mode
	spectrograph4 - mode
	spectrograph2 - mode
	infrared3 - mode
	thermograph0 - mode
	infrared6 - mode
	infrared5 - mode
	Star0 - direction
	GroundStation1 - direction
	Star3 - direction
	GroundStation4 - direction
	Star2 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 infrared5)
	(supports instrument0 infrared6)
	(supports instrument0 thermograph0)
	(supports instrument0 infrared3)
	(supports instrument0 spectrograph2)
	(supports instrument0 image1)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
)
(:goal (and
	(have_image Phenomenon5 spectrograph2)
	(have_image Planet6 infrared5)
	(have_image Planet7 image1)
	(have_image Planet7 infrared5)
	(have_image Phenomenon8 thermograph0)
	(have_image Phenomenon9 infrared3)
	(have_image Phenomenon9 spectrograph4)
	(have_image Phenomenon10 infrared3)
	(have_image Phenomenon10 image1)
	(have_image Phenomenon11 infrared5)
	(have_image Phenomenon11 spectrograph4)
	(have_image Star12 infrared6)
	(have_image Star13 thermograph0)
	(have_image Star13 image1)
	(have_image Star14 infrared5)
	(have_image Star14 thermograph0)
))

)

; plan
1. (turn_to satellite0 star2 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star2)
   goals met: 0 of 16
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 16
3. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 16
4. (turn_to satellite0 planet6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet6)
   goals met: 0 of 16
5. (take_image satellite0 planet6 instrument0 infrared5)
   added: (have_image planet6 infrared5)
   goals met: 1 of 16
6. (turn_to satellite0 phenomenon8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon8)
   goals met: 1 of 16
7. (take_image satellite0 phenomenon8 instrument0 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 2 of 16
8. (turn_to satellite0 phenomenon5 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon5)
   goals met: 2 of 16
9. (take_image satellite0 phenomenon5 instrument0 spectrograph2)
   added: (have_image phenomenon5 spectrograph2)
   goals met: 3 of 16
10. (turn_to satellite0 phenomenon11 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 16
11. (take_image satellite0 phenomenon11 instrument0 spectrograph4)
   added: (have_image phenomenon11 spectrograph4)
   goals met: 4 of 16
12. (take_image satellite0 phenomenon11 instrument0 infrared5)
   added: (have_image phenomenon11 infrared5)
   goals met: 5 of 16
13. (turn_to satellite0 phenomenon10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon10)
   goals met: 5 of 16
14. (take_image satellite0 phenomenon10 instrument0 infrared3)
   added: (have_image phenomenon10 infrared3)
   goals met: 6 of 16
15. (take_image satellite0 phenomenon10 instrument0 image1)
   added: (have_image phenomenon10 image1)
   goals met: 7 of 16
16. (turn_to satellite0 phenomenon9 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon9)
   goals met: 7 of 16
17. (take_image satellite0 phenomenon9 instrument0 infrared3)
   added: (have_image phenomenon9 infrared3)
   goals met: 8 of 16
18. (take_image satellite0 phenomenon9 instrument0 spectrograph4)
   added: (have_image phenomenon9 spectrograph4)
   goals met: 9 of 16
19. (turn_to satellite0 planet7 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet7)
   goals met: 9 of 16
20. (take_image satellite0 planet7 instrument0 image1)
   added: (have_image planet7 image1)
   goals met: 10 of 16
21. (take_image satellite0 planet7 instrument0 infrared5)
   added: (have_image planet7 infrared5)
   goals met: 11 of 16
22. (turn_to satellite0 star12 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star12)
   goals met: 11 of 16
23. (take_image satellite0 star12 instrument0 infrared6)
   added: (have_image star12 infrared6)
   goals met: 12 of 16
24. (turn_to satellite0 star13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star13)
   goals met: 12 of 16
25. (take_image satellite0 star13 instrument0 image1)
   added: (have_image star13 image1)
   goals met: 13 of 16
26. (take_image satellite0 star13 instrument0 thermograph0)
   added: (have_image star13 thermograph0)
   goals met: 14 of 16
27. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 14 of 16
28. (take_image satellite0 star14 instrument0 infrared5)
   added: (have_image star14 infrared5)
   goals met: 15 of 16
29. (take_image satellite0 star14 instrument0 thermograph0)
   added: (have_image star14 thermograph0)
   goals met: 16 of 16
